Revit 2027 API
ViewAnchor Enumeration
 An enumerated type listing options for the anchor point used by the placed view. The anchor point determines how the view position is updated if assigned to a saved position or swapped to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewAnchor
Public Enumeration ViewAnchor
public enum class ViewAnchor
type ViewAnchor
Members
Member name | Value | Description
BottomLeft | 5 |  Available for crop-region enabled views and aligns the view using the bottom left of the crop region boundary as the reference.
BottomRight | 4 |  Available for crop-region enabled views and aligns the view using the bottom right of the crop region boundary as the reference.
Center | 1 |  Available for crop-region enabled views and aligns the view using the center of the crop region boundary as the reference.
TopLeft | 2 |  Available for crop-region enabled views and aligns the view using the top left of the crop region boundary as the reference.
TopRight | 3 |  Available for crop-region enabled views and aligns the view using the top right of the crop region boundary as the reference.
ViewOrigin | 0 |  Available for all views and aligns the view using the origin of the view as the reference.
See Also
Reference
Autodesk.Revit.DB Namespace